In [ ]:
# ! pip list

In [1]:
import pandas as pd
import numpy as np

In [ ]:
#we can assign function to variable
fun = print
fun('Akshay')

In [ ]:
a = 'Sanjay'
fun(a)

In [ ]:
#here are location of variable 
id(a)

In [ ]:
type(print)

In [ ]:
Name = 'Akshay'
midname = 'Sanjay'
Lastname = 'Kanchan'
print(f'Name:       {Name}\nSurname:    {midname}\nLastname:    {Lastname}')

In [ ]:
def fullname(name,midname,lastname):
    return print(f'Name:       {name}\nSurname:    {midname}\nLastname:    {lastname}')


fullname('aks','san','kan')

In [ ]:
import pandas as pd

In [28]:
a = 'Akshay Kanchan'
' '.join(a)

'A k s h a y   K a n c h a n'

In [15]:
a=set(range(1,10))
print(type(a),a)

<class 'set'> {1, 2, 3, 4, 5, 6, 7, 8, 9}

In [22]:
for i in range(10):
    print(i,"",end="")

0 1 2 3 4 5 6 7 8 9

In [ ]:
i = 1
while i<10:
    print(i,'',end="")
    i += 1

1 2 3 4 5 6 7 8 9

In [36]:
list =[x*2 for x in range(1,11)]
print(type(list),"",list)

<class 'list'>  [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [42]:
list1 = [x for x in range(1,21) if x%2==0 ]
list1

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [51]:
(lambda x: x*2)(3)

6

In [55]:
mul2 = lambda x,y : x*2+1
mul2(5,1)

11

In [9]:
import pandas as pd
df = pd.DataFrame({'a':[1,2,5,5],'b':[2,3,53,56]})

In [12]:
df.query('a>2')

   a   b
2  5  53
3  5  56

In [18]:
df = pd.DataFrame({
    'Category': ['A', 'B', 'A', 'B', 'A'],
    'Value': [10, 20, 30, 40, 50]
})
pivot_table = df.pivot_table(values='Value', index='Category', aggfunc='sum')
print(df.head(10),"\n",pivot_table)

  Category  Value
0        A     10
1        B     20
2        A     30
3        B     40
4        A     50
           Value
Category
A            90
B            60

In [19]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob'],
    'Math': [90, 85],
    'Science': [95, 80]
})
pd.melt(df, id_vars='Name', value_vars=['Math', 'Science'], 
        var_name='Subject', value_name='Score')

    Name  Subject  Score
0  Alice     Math     90
1    Bob     Math     85
2  Alice  Science     95
3    Bob  Science     80